DataProcessors/ТТМ_АРМ_ВыпускРеализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТТМ_АРМ_ВыпускРеализация</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изделие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧТоварыРеализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧТоварыРеализацииССН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧВыпущенныеЭтапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запланировано</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЭтаповПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧВыпущенныеТоварыЗаказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТМ_ПланПроизводства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТТМ_АРМ_ВыпускРеализация/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке()Экспорт

	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.РеализацияТоваровУслуг"); //Документ к которому делаем внешнюю печатную форму
	//Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеПривилегированногоРежима();
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка"); //может быть - ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов... 
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "АРМ выпуск и реализация"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	ПараметрыРегистрации.Вставить("Информация", "АРМ выпуск и реализация"); 
	//ПараметрыРегистрации.Разрешения.Добавить(Разрешение);
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "АРМ выпуск и реализация", "АРМ_ВыпускИРеализацияERP", "ОткрытиеФормы", Истина, "АРМ_ВыпускИРеализацияERP");  //"ЗагрузкаДанныхИзФайла" Перечисления.СпособыВызоваДополнительныхОбработок.ОткрытиеФормы
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);

	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ.формы для пользователя
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); //имя макета печ.формы
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); //ВызовСерверногоМетода
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление; 
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры

#КонецОбласти

#Область РеализацияПоЗаказуКлиента

//Группировка всех заказов с выпуском
функция ГруппировкаЗаказовСВыпуском(ВыгруженныеЗаказы, Знач ОбъеденитьЗаказыСОбщейНоменклатурой = Ложь) Экспорт
	ТаблицаТоваров = Новый ТаблицаЗначений;
	
	Если ОбъеденитьЗаказыСОбщейНоменклатурой Тогда
		ТаблицаТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		ТаблицаТоваров.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ТаблицаТоваров.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		
		Для Каждого ТоварОтгрузки Из ВыгруженныеЗаказы Цикл
			ТоварНайден = Ложь;
		
			//Суммируем количество товаров, если есть одинаковая номенклатура при условии, что заказы разные
			Для Каждого Товар Из ТаблицаТоваров Цикл
				Если Товар.Номенклатура = ТоварОтгрузки.Номенклатура Тогда
					ТоварНайден = Истина;
					Товар.Количество = Товар.Количество + ТоварОтгрузки.КОтгрузке;
					Прервать;
				КонецЕсли;
			КонецЦикла;
				
			Если Не ТоварНайден Тогда
				НоваяСтрокаТЗ = ТаблицаТоваров.Добавить();
				НоваяСтрокаТЗ.Номенклатура = ТоварОтгрузки.Номенклатура;
				НоваяСтрокаТЗ.Количество = ТоварОтгрузки.КОтгрузке;
				НоваяСтрокаТЗ.Организация = ТоварОтгрузки.ЗаказКлиента.Организация;   //ДокументОтгрузки
				НоваяСтрокаТЗ.Склад = ТоварОтгрузки.Склад;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТаблицаТоваров.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата")); 
		ТаблицаТоваров.Колонки.Добавить("ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
		ТаблицаТоваров.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
		ТаблицаТоваров.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ТаблицаТоваров.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	
		Для Каждого ЗначениеПараметра Из ВыгруженныеЗаказы Цикл
			ЗаказНайден = Ложь;
			
			//Объединяем заказы с общим номером
			Для Каждого Товар Из ТаблицаТоваров Цикл
				Если Товар.ЗаказКлиента = ЗначениеПараметра.ДокументОтгрузки Тогда
					ЗаказНайден = Истина;			
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ЗаказНайден Тогда
				НоваяСтрокаТЗ = ТаблицаТоваров.Добавить();
				НоваяСтрокаТЗ.Дата = ЗначениеПараметра.ДокументОтгрузки.Дата;
				НоваяСтрокаТЗ.ЗаказКлиента = ЗначениеПараметра.ДокументОтгрузки;
				НоваяСтрокаТЗ.Назначение = ЗначениеПараметра.Назначение;
				НоваяСтрокаТЗ.Организация = ЗначениеПараметра.ДокументОтгрузки.Организация;
				НоваяСтрокаТЗ.Склад = ЗначениеПараметра.Склад;
			КонецЕсли;		
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаТоваров;
КонецФункции

//Проверка установленных цен в заказе клиента
Функция ПроверитьУстановленныеЦеныВЗаказеКлиента(ПараметрыОтбора) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗЦеныИГраницы.Порог КАК Граница,
	               |	ТЗЦеныИГраницы.ВидЦены КАК ВидЦен,
	               |	ТЗЦеныИГраницы.ОсновнаяЦена КАК ОсновнаяЦена
	               |ПОМЕСТИТЬ втГраницыИЦены
	               |ИЗ
	               |	&ТЗГраницыИЦены КАК ТЗЦеныИГраницы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ _ТоварыРеализации
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата >= &ДатаНачала
	               |	И РеализацияТоваровУслугТовары.Ссылка.Дата <= &ДатаОкончания
	               |	И РеализацияТоваровУслугТовары.Ссылка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента КАК ЗаказКлиента
	               |ПОМЕСТИТЬ _ЗаказыРеализаций
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата >= &ДатаНачала
	               |	И РеализацияТоваровУслугТовары.Ссылка.Дата <= &ДатаОкончания
	               |	И РеализацияТоваровУслугТовары.Ссылка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	               |	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	               |	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоУпаковок
	               |ПОМЕСТИТЬ _КоличествоТовараПоЗаказу
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				Т.ЗаказКлиента
	               |			ИЗ
	               |				_ЗаказыРеализаций КАК Т)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Ссылка,
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	ЗаказКлиентаТовары.Упаковка,
	               |	ЗаказКлиентаТовары.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	               |	РеализацияТоваровУслугТовары.Упаковка КАК ЕдиницаИзмерения,
	               |	_КоличествоТовараПоЗаказу.ЗаказКлиента.НомерПоДаннымКлиента КАК НомерЗаказа,
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата КАК ДатаОтгрузки,
	               |	_КоличествоТовараПоЗаказу.ЗаказКлиента.ДатаПоДаннымКлиента КАК ДатаЗаказа,
	               |	_КоличествоТовараПоЗаказу.КоличествоУпаковок КАК Количество,
	               |	ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Цена КАК ЧИСЛО(15, 0)) КАК Цена,
	               |	РеализацияТоваровУслугТовары.Ссылка КАК Реализация
	               |ПОМЕСТИТЬ _ТЗТовары
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ _КоличествоТовараПоЗаказу КАК _КоличествоТовараПоЗаказу
	               |		ПО РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента = _КоличествоТовараПоЗаказу.ЗаказКлиента
	               |			И РеализацияТоваровУслугТовары.Номенклатура = _КоличествоТовараПоЗаказу.Номенклатура
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата >= &ДатаНачала
	               |	И РеализацияТоваровУслугТовары.Ссылка.Дата <= &ДатаОкончания
	               |	И РеализацияТоваровУслугТовары.Ссылка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(втГраницыИЦены.Граница, 0) КАК Граница,
	               |	ЕСТЬNULL(втГраницыИЦены.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦен,
	               |	_ТЗТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ГраницыИЦены
	               |ИЗ
	               |	_ТЗТовары КАК _ТЗТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втГраницыИЦены КАК втГраницыИЦены
	               |		ПО (втГраницыИЦены.Граница <= _ТЗТовары.Количество)
	               |ГДЕ
	               |	втГраницыИЦены.ОсновнаяЦена = &ВидЦены
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	_ТЗТовары.Номенклатура,
	               |	ЕСТЬNULL(втГраницыИЦены.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)),
	               |	ЕСТЬNULL(втГраницыИЦены.Граница, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ГраницыИЦены.Граница) КАК Граница,
	               |	ГраницыИЦены.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ МаксГраница
	               |ИЗ
	               |	ГраницыИЦены КАК ГраницыИЦены
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГраницыИЦены.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Период,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	               |	ГраницыИЦены.Граница КАК Граница,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦены,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЦенаУстановленная,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПУстаяССылка)) КАК Упаковка,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПУстаяСсылка)) КАК Характеристика,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Регистратор, ЗНАЧЕНИЕ(Документ.УстановкаЦенНоменклатуры.ПустаяСсылка)) КАК Регистратор
	               |ПОМЕСТИТЬ ВсеПодходящиеСкидочныеЦены
	               |ИЗ
	               |	ГраницыИЦены КАК ГраницыИЦены
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО (ЦеныНоменклатурыСрезПоследних.ВидЦены = ГраницыИЦены.ВидЦен)
	               |			И ГраницыИЦены.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.Цена <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	               |	МАКСИМУМ(ГраницыИЦены.Граница) КАК Граница
	               |ПОМЕСТИТЬ МаксимальноДоступнаяГраница
	               |ИЗ
	               |	ГраницыИЦены КАК ГраницыИЦены
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО (ЦеныНоменклатурыСрезПоследних.ВидЦены = ГраницыИЦены.ВидЦен)
	               |			И ГраницыИЦены.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.Цена <> 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеПодходящиеСкидочныеЦены.Период КАК Период,
	               |	ВсеПодходящиеСкидочныеЦены.Регистратор КАК Регистратор,
	               |	ВсеПодходящиеСкидочныеЦены.Номенклатура КАК Номенклатура,
	               |	ВсеПодходящиеСкидочныеЦены.Характеристика КАК Характеристика,
	               |	ВсеПодходящиеСкидочныеЦены.Граница КАК Граница,
	               |	ВсеПодходящиеСкидочныеЦены.ВидЦены КАК ВидЦены,
	               |	ВсеПодходящиеСкидочныеЦены.ЦенаУстановленная КАК ЦенаУстановленная,
	               |	ВсеПодходящиеСкидочныеЦены.Упаковка КАК Упаковка,
	               |	ВсеПодходящиеСкидочныеЦены.Валюта КАК Валюта
	               |ПОМЕСТИТЬ ПредварительныеДанные
	               |ИЗ
	               |	ВсеПодходящиеСкидочныеЦены КАК ВсеПодходящиеСкидочныеЦены
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальноДоступнаяГраница КАК МаксимальноДоступнаяГраница
	               |		ПО ВсеПодходящиеСкидочныеЦены.Граница = МаксимальноДоступнаяГраница.Граница
	               |			И ВсеПодходящиеСкидочныеЦены.Номенклатура = МаксимальноДоступнаяГраница.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	_ТЗТовары.НомерЗаказа КАК Заказ,
	               |	_ТЗТовары.Реализация КАК Реализация,
	               |	_ТЗТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ЕСТЬNULL(ПредварительныеДанные.Номенклатура, _ТЗТовары.Номенклатура) КАК Номенклатура,
	               |	ЕСТЬNULL(ПредварительныеДанные.ВидЦены, &ВидЦены) КАК ВидЦены,
	               |	ЕСТЬNULL(ПредварительныеДанные.ЦенаУстановленная, 0) КАК ЦенаУстановленная,
	               |	_ТЗТовары.Цена КАК ЦенаРеализации,
	               |	(ПредварительныеДанные.ЦенаУстановленная - _ТЗТовары.Цена) / ПредварительныеДанные.ЦенаУстановленная * 100 КАК ПроцентОтличия,
	               |	_ТЗТовары.Цена - ПредварительныеДанные.ЦенаУстановленная КАК Разница,
	               |	ЕСТЬNULL(ПредварительныеДанные.Валюта, &Валюта) КАК Валюта,
	               |	ЕСТЬNULL(ПредварительныеДанные.Регистратор, ЗНАЧЕНИЕ(Документ.УстановкаЦенНоменклатуры.ПустаяСсылка)) КАК УстановкаЦен
	               |ИЗ
	               |	_ТЗТовары КАК _ТЗТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПредварительныеДанные КАК ПредварительныеДанные
	               |		ПО (_ТЗТовары.Номенклатура = ЕСТЬNULL(ПредварительныеДанные.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |ГДЕ
	               |	ПредварительныеДанные.ЦенаУстановленная - _ТЗТовары.Цена <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	 
	Запрос.УстановитьПараметр("Валюта", ПараметрыОтбора["Валюта"]);
	Запрос.УстановитьПараметр("ТЗГраницыИЦены", ПараметрыОтбора["ТЗГраницыИЦены"]);
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыОтбора["ДатаНачала"]);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыОтбора["ДатаОкончания"]);
	Запрос.УстановитьПараметр("НаДату", ПараметрыОтбора["НаДату"]);
	Запрос.УстановитьПараметр("ВидЦены", ПараметрыОтбора["ВидЦены"]);
	
	ВыгруженнаяТаблица = Запрос.Выполнить().Выгрузить();
	Возврат ВыгруженнаяТаблица;
	
КонецФункции

#КонецОбласти
